{
  "TITLE": "NestCast - Podcast Hosting for Everyone",
  "KEYWORDS": "nestcast podcast hosting rss feed spotify",
  "DESCRIPTION": "We host your podcast at a much lower price than other hosting companies, allowing you to keep your podcast available for an extended period.",
  "HOME": {
    "LANDING": {
      "INTRO": {
        "subTitle": "The Best Hosting for Your Podcast",
        "title": "Host Your Podcast with NestCast",
        "buttonText": "Join the Waitlist",
        "text": [
          "NestCast helps you quickly and easily distribute your podcast to Spotify, Apple Podcasts, Podimo, and all other smaller podcast platforms. We ensure that your podcast becomes available through an RSS feed, the format used to make podcasts available on platforms like Spotify and Apple Podcasts.",
          "NestCast is capable of providing the best podcast service at a competitive price. We achieve this by leveraging AI and machine learning. Our revolutionary platform is maintained by a small team, keeping our costs low."
        ]
      },
      "SNIPPET_RIGHT": {
        "title": "Podcast Hosting & RSS",
        "text": [
          "To host a podcast, it is necessary to make your audio files available on a server and generate an RSS feed that indicates which episodes are available. This RSS feed is used by podcast platforms like Spotify and Apple Podcasts to make your podcast accessible to listeners.",
          "While many companies focus on podcast hosting, NestCast is the only one dedicated solely to hosting and distributing podcasts. This is why we excel in what we do.",
          "We use the latest techniques and services to achieve the highest service level possible at a low price. We work with Angular 16, NestJs, and MongoDB, ensuring a fast and reliable service. Our developers are constantly focused on innovation and improving our service to provide a state-of-the-art product."
        ],
        "images": [
          "assets/images/pictures/podcaster-1.jpg",
          "assets/images/pictures/podcaster-2.jpg",
          "assets/images/pictures/podcaster-3.jpg"
        ]
      },
      "SNIPPET_LEFT": {
        "title": "Podcast Platforms",
        "text": [
          "Spotify, Amazon Music, Samsung Podcasts, Podcast Index, Listen Notes, Apple Podcasts, Google Podcasts, Pandora, Tune In, iHeartRadio, Deezer. These are just a few of the platforms where we can make your podcast available. We ensure that your podcast is accessible to as many listeners as possible.",
          "The RSS feed we provide for your podcast is crafted to be compatible with all platforms. You have optimal control over how your podcast is displayed on different platforms."
        ],
        "images": [
          "assets/images/pictures/podcaster-4.jpg",
          "assets/images/pictures/podcaster-5.jpg"
        ]
      }
    },
    "ABOUT": {
      "INTRO": {
        "subTitle": "The Technology Behind NestCast",
        "title": "About NestCast",
        "text": [
          "NestCast was born out of a passion for podcasts and technology. Our founder, Joris Pieters, has been creating podcasts for years. He produced the popular podcast \"B&Gay Full of Love,\" documenting the adventures of the candidates from the show \"B&B Full of Love.\"",
          "Combining podcast knowledge with a background as a Full Stack Developer made it possible to create a highly technological platform for podcast hosting. Given the increasing role of AI and machine learning in technology, NestCast also incorporates these techniques, aiming to innovate even faster."
        ]
      },
      "WORD": {
        "subTitle": "The Technology Behind NestCast",
        "title": "Founder's Message",
        "text": [
          "NestCast started as a side project, a common occurrence for developers passionate about their craft. Over the years, many ideas for new products have come and gone, but NestCast was one project that needed to be put into production.",
          "As a freelance developer, having a strong portfolio is crucial. While NestCast initially served as a showcase, as we got more serious about it, enthusiasm grew. Each milestone brings a satisfying feeling, which is essential when your work is also your passion.",
          "We aim to make our code open source where possible, emphasizing security and privacy. We want to share our knowledge with other developers and showcase our approach to good solutions.",
          "Joris Pieters"
        ]
      },
      "TECHNIQUES": {
        "title": "Techniques",
        "text": [
          "We use the latest techniques and services to achieve the highest service level possible. Users mainly interact with the frontend of our application to manage and distribute their podcasts. We have developed a SPA (Single Page Application) for this purpose, providing a user experience without page refreshes during usage."
        ],
        "stack": [
          {
            "type": "programming",
            "title": "Tech Stack",
            "text": [
              "NestCast uses Angular to provide a modern user experience. Angular is a framework maintained by Google. TypeScript is used for programming within the framework. In our backend, we use Nest.js, a backend framework based on Node, where TypeScript is also the programming language. Nest's structure is largely based on Angular."
            ],
            "items": [
              {
                "type": "angular",
                "title": "Angular 16",
                "text": "Frontend framework maintained by Google"
              },
              {
                "type": "ngrx",
                "title": "NgRx",
                "text": "State management for Angular based on Redux"
              },
              {
                "type": "nestjs",
                "title": "NestJs",
                "text": "NodeJS backend framework based on the module structure of Angular"
              },
              {
                "type": "nodejs",
                "title": "NodeJs",
                "text": "Framework that enabled server-side JavaScript usage"
              },
              {
                "type": "typescript",
                "title": "TypeScript",
                "text": "Layer on top of JavaScript to provide type safety"
              },
              {
                "type": "javascript",
                "title": "JavaScript",
                "text": "The language of the web"
              }
            ]
          },
          {
            "type": "testing",
            "title": "Automated Tests",
            "text": [
              "To enhance the quality of our software and keep costs low, automated tests are indispensable. We employ various types of tests to ensure the quality of our software."
            ],
            "items": [
              {
                "type": "jest",
                "title": "Jest",
                "text": "Jest is a JavaScript testing framework designed to guarantee the accuracy of every JavaScript codebase."
              },
              {
                "type": "spectator",
                "title": "Spectator",
                "text": "A layer on the Angular test framework to simplify the testing of Angular components."
              },
              {
                "type": "cypress",
                "title": "Cypress",
                "text": "An end-to-end testing framework for web applications. It is built on top of Mocha, Chai, and Sinon."
              }
            ]
          },
          {
            "type": "services",
            "title": "Services",
            "text": [
              "To host our application and distribute your podcast, we use various services. All these services are cloud services, meaning we don't have our own servers, and we utilize the servers provided by these services. This ensures that we don't need to maintain our servers, and we can always leverage the latest technologies."
            ],
            "items": [
              {
                "type": "mongodb",
                "title": "MongoDB",
                "text": "A NoSQL database that we use to store the data of your podcast."
              },
              {
                "type": "github",
                "title": "GitHub",
                "text": "This is an online service to manage and share our code with other developers."
              },
              {
                "type": "githubactions",
                "title": "GitHub Actions",
                "text": "Automated software deployment using GitHub Actions pipelines."
              }
            ]
          },
          {
            "type": "cloud_services",
            "title": "Cloud Services",
            "text": [
              "Hosting web applications and APIs is a specialized field. We use various cloud services to host our application and make your podcast available. Our cloud provider is AWS, Amazon Web Services. AWS is the largest cloud provider globally, offering a wide range of services."
            ],
            "items": [
              {
                "type": "aws",
                "title": "AWS",
                "text": "Amazon Web Services is a cloud computing platform offered by Amazon.com."
              },
              {
                "type": "awss3",
                "title": "AWS S3",
                "text": "S3 is the storage service of AWS. We use S3 to store the audio files of your podcast."
              },
              {
                "type": "awslambda",
                "title": "AWS Lambda",
                "text": "AWS Lambda is a serverless computing service that executes code in response to events and automatically scales the required computing resources."
              },
              {
                "type": "serverless",
                "title": "Serverless",
                "text": "Serverless is a framework that enables the development and deployment of serverless applications, for example, on AWS Lambda."
              }
            ]
          },
          {
            "type": "AI",
            "title": "Artificial Intelligence (AI)",
            "text": [
              "This text is generated by an AI. We use AI to enhance the quality of our software and keep costs low. We employ various types of AI to ensure the quality of our software."
            ],
            "items": [
              {
                "type": "codium",
                "title": "Codium",
                "text": "Codium analyzes code and automatically writes tests; it also provides code suggestions."
              },
              {
                "type": "chatgpt",
                "title": "ChatGPT",
                "text": "ChatGPT is a prototype of a chatbot with artificial intelligence, developed by OpenAI."
              },
              {
                "type": "githubcopilot",
                "title": "GitHub Copilot",
                "text": "GitHub Copilot translates natural language prompts into coding suggestions in dozens of languages."
              }
            ]
          }
        ]
      }
    },
    "PRICING": {
      "INTRO": {
        "subTitle": "The highest price-quality ratio",
        "title": "Subscriptions",
        "buttonText": "I want to join the waiting list",
        "text": [
          "Our subscriptions will have a low price for both business and private customers. We focus mainly on customers who consider it essential to have and maintain their podcast.",
          "To keep your podcast available, it is crucial that the price is not too high. Sometimes, when listeners decline, it may no longer be profitable to keep your podcast available. We ensure that your podcast remains available at a low price."
        ]
      },
      "SNIPPET_RIGHT": {
        "title": "Personal subscription",
        "text": [
          "For hobbyists or beginner podcasters, the personal subscription is a good choice. You can host and make all your episodes available on major platforms. You have access to an extensive management console where you can manage your podcast and view statistics.",
          "Businesses have a lot of content that may not be very current but is important to keep available. NestCast helps these businesses keep their content available without unnecessarily high costs."
        ],
        "images": [
          "assets/images/pictures/personal-1.jpg",
          "assets/images/pictures/personal-2.jpg",
          "assets/images/pictures/personal-3.jpg"
        ]
      },
      "SNIPPET_LEFT": {
        "subTitle": "The highest price-quality ratio",
        "title": "Business subscriptions",
        "text": [
          "For our business customers, we offer a similar subscription to our private customers. The difference lies in billing. With a business subscription, the invoice is issued in the name of the company.",
          "To keep your podcast available, it is crucial that the price is not too high. Sometimes, when listeners decline, it may no longer be profitable to keep your podcast available. We ensure that your podcast remains available at a low price."
        ],
        "images": [
          "assets/images/pictures/business-1.jpg",
          "assets/images/pictures/business-2.jpg",
          "assets/images/pictures/business-3.jpg"
        ]
      },
      "PRICING": {
        "title": "Subscriptions",
        "text": [
          "From early 2024, two subscriptions will be available at a similar price. A business subscription and a private subscription. The subscriptions are available with a so-called fair use policy. If the use of your podcast exceeds a certain limit, a surcharge will be applied. This surcharge depends on the number of listeners and the duration of the podcast."
        ],
        "cards": [
          {
            "title": "Personal",
            "price": "± €5.00",
            "usps": [
              "Host all your episodes",
              "Extensive management console",
              "Podcast available on major platforms",
              "Statistics"
            ]
          },
          {
            "title": "Business",
            "price": "± €5.00",
            "usps": [
              "In the name of the company",
              "Comprehensive management console",
              "Podcast available on major platforms",
              "Statistics"
            ]
          }
        ]
      }
    },
    "CONTACT": {
      "INTRO": {
        "subTitle": "How are you?",
        "title": "Contact NestCast",
        "buttonText": "Send us a message",
        "text": [
          "NestCast is a company that wants to open up to customers, technical talent, colleagues in the podcast hosting field. Like a part of our software is open source, we are an open book.",
          "We are always looking for new customers, but also for new colleagues. Are you a developer and want to work on an innovative product? Contact us. If you have feedback on our product, we would also love to hear that."
        ]
      },
      "PLACE": {
        "subTitle": "Amsterdam is our home",
        "title": "Our location",
        "buttonText": "Send us a message",
        "text": [
          "NestCast is an Amsterdam-based company, and we are proud of it. Amsterdam is bursting with IT talent and has an excellent start-up climate. Amsterdam is also the podcast capital of the Netherlands. We are proud to have our company here. Our office is located in Amsterdam West, Bos en Lommer."
        ]
      },
      "FORM": {
        "title": "Send us a message",
        "text": "We like to stay in touch with our customers, potential business partners, colleagues, and future employees. Use this form to get in touch with us."
      },
      "SUCCESSMESSAGE": {
        "title": "Thank you for your message",
        "text": "We have received your message."
      },
      "ERRORMESSAGE": {
        "title": "Failed",
        "text": "Something went wrong, please try again later."
      },
      "ERRORMESSAGECONFIRM": {
        "title": "Failed",
        "text": "Your message could not be confirmed, please try again."
      }
    }
  },
  "AUTH": {
    "SIGN_IN": {
      "ERROR": {
        "title": "Failed",
        "text": "Something went wrong, please try again later."
      }
    }
  },
  "USER": {
    "SIGN_UP": {
      "ERROR": {
        "title": "Failed",
        "text": "Your login credentials are incorrect, please try again."
      },
      "SUCCESS": {
        "title": "Thank you for signing up",
        "text": "We have received your registration. Log in to continue."
      }
    },
    "SIGN_IN": {
      "ERROR": {
        "title": "Failed",
        "text": "Something went wrong, please try again later."
      }
    },
    "PASSWORD_RESET": {
      "ERROR": {
        "title": "Failed",
        "text": "Something went wrong, please try again later."
      },
      "SUCCESS": {
        "title": "Thank you for signing up",
        "text": "We have received your registration. You will receive an email to confirm your registration."
      }
    },
    "REQUEST_PASSWORD_RESET": {
      "ERROR": {
        "title": "Failed",
        "text": "Something went wrong, please try again later."
      },
      "SUCCESS": {
        "title": "Thank you for signing up",
        "text": "We have received your registration. You will receive an email to confirm your registration."
      }
    },
    "CONFIRM_USERNAME": {
      "ERROR": {
        "title": "Failed",
        "text": "Something went wrong, please try again later."
      },
      "SUCCESS": {
        "title": "Thank you",
        "text": "Your username has been verified. You can now log in."
      }
    }
  },
  "FOOTER": {
    "ABOUT": {
      "title": "About NestCast",
      "text": [
        "NestCast aims to be the most technically advanced podcast hosting company. By using AI and the latest technologies, we are able to provide the best service at the lowest price."
      ]
    },
    "CONTACT": {
      "website": "https://www.nestcast.net",
      "email": "info@nestcast.net",
      "title": "Get in touch",
      "name": "NestCast",
      "address": "Hoofdweg 562",
      "zipcode": "1055AB",
      "place": "Amsterdam"
    },
    "NAVIGATION": {
      "title": "Navigation"
    }
  },
  "WAITINGLIST": {
    "FORM": {
      "title": "Sign up for the waiting list",
      "text": "Do you want to be the first to use our podcast hosting platform? Register using this form."
    },
    "SUCCESSMESSAGE": {
      "title": "Thank you for your interest",
      "text": "You are enrolled in the waiting list"
    },
    "ERRORMESSAGE": {
      "title": "Failed",
      "text": "Something went wrong, please try again later."
    },
    "ERRORMESSAGECONFIRM": {
      "title": "Failed",
      "text": "Your registration could not be confirmed, please try again."
    }
  },
  "FORM": {
    "FIRSTNAME": "First Name",
    "USERNAME": "Username",
    "LASTNAME": "Last Name",
    "PASSWORD": "Password",
    "EMAILADDRESS": "Email Address",
    "MESSAGE": "Message",
    "TERMS": "I agree to the terms and conditions",
    "CONTACTTERMS": "I agree to the communication terms"
  },
  "EMAILCONFIRMATION": {
    "title": "Confirm your email address",
    "text": "To prevent abuse and protect your privacy, we ask you to confirm your contact request. This ensures that we do not send unwanted messages. We have sent a code to your email address."
  },
  "CANCEL": "Cancel",
  "CONFIRM": "Confirm",
  "SEND": "Send",
  "MENU": {
    "HOME": "Home",
    "PRICING": "Pricing",
    "ABOUT": "About us",
    "CONTACT": "Contact",
    "SIGN_IN": "Sign In",
    "SIGN_UP": "Sign Up"
  },
  "SOCIALMEDIA": {
    "INSTAGRAM": "https://www.instagram.com/nestcastnet/",
    "X": "https://x.com/nestcastnet",
    "FACEBOOK": "https://www.facebook.com/profile.php?id=61553274982927",
    "LINKEDIN": "https://www.linkedin.com/company/100249897"
  },
  "SECURE": {
    "SHOW": {
      "FORM": {
        "TITLE": "Title",
        "DESCRIPTION": "Description",
        "AUTHOR": "Author",
        "EMAIL": "Email",
        "COPYRIGHT": "Copyright",
        "CATEGORY": "Category",
        "LANGUAGE": "Language",
        "SUB_CATEGORY": "Subcategory",
        "KEYWORDS": "Keywords",
        "EXPLICIT": "Explicit",
        "CANCEL": "Cancel",
        "SAVE": "Save"
      }
    },
    "EPISODE": {
      "FORM": {
        "TITLE": "Title",
        "DESCRIPTION": "Description",
        "TYPE": "Type",
        "SEASON": "Season",
        "EPISODE": "Episode",
        "KEYWORDS": "Keywords",
        "EXPLICIT": "Explicit",
        "CANCEL": "Cancel",
        "SAVE": "Save"
      }
    }
  }
}
