{
  "TITLE": "NestCast - Podcast for everybody",
  "KEYWORDS": "EN podcast hosting rss feed",
  "DESCRIPTION": "ENGELS hosten jouw podcast voor een veel lagere prijs dan andere hosting bedrijven. Hierdoor kan je langdurig jouw podcast beschikbaar houden.",
  "HOME": {
    "INTRO": {
      "subTitle": "The best hosting for your podcast",
      "title": "Host your Podcast with NestCast",
      "buttonText": "I want to join the waiting list",
      "text": [
        "NestCast helps you quickly and easily distribute your podcast to Spotify, Apple Podcasts, Podimo, and all other smaller podcast platforms. We ensure that your podcast becomes available using an RSS feed, the format for making podcasts available on podcast platforms like Spotify and Apple Podcasts.",
        "NestCast is capable of providing the best podcast service at a competitive price. We achieve this by using AI and machine learning. Our revolutionary platform is maintained by a small team, keeping our costs low."
      ]
    },
    "SNIPPET_RIGHT": {
      "title": "Podcast Hosting & RSS",
      "text": [
        "To host a podcast, it's necessary to make your audio files available on a server and generate an RSS feed that lists the available episodes. This RSS feed is used by podcast platforms like Spotify and Apple Podcasts to make your podcast accessible to listeners.",
        "Many companies focus on podcast hosting, but NestCast is the only one dedicated solely to hosting and distributing podcasts. This is why we excel at what we do.",
        "We use the most advanced techniques and services to provide the highest service level possible at a low price. We work with Angular 16, NestJs, and MongoDB. This ensures that we can deliver a fast and reliable service. Our developers are constantly working on innovation and improving our service to ensure you always have a state-of-the-art product."
      ],
      "images": [
        "assets/images/pictures/podcaster-1.jpg",
        "assets/images/pictures/podcaster-2.jpg",
        "assets/images/pictures/podcaster-3.jpg"
      ]
    },
    "SNIPPET_LEFT": {
      "title": "Podcast Platforms",
      "text": [
        "Spotify, Amazon Music, Samsung Podcasts, Podcast Index, Listen Notes, Apple Podcasts, Google Podcasts, Pandora, Tune In, iHeartRadio, Deezer. These are just some of the platforms where we can make your podcast available. We ensure that your podcast is available to as many listeners as possible.",
        "The RSS feed we make available for your podcast is designed to be compatible with all platforms. You have optimal control over how your podcast is presented on different platforms."
      ],
      "images": [
        "assets/images/pictures/podcaster-4.jpg",
        "assets/images/pictures/podcaster-5.jpg"
      ]
    }
  },
  "ABOUT": {
    "INTRO": {
      "subTitle": "The technology behind NestCast",
      "title": "About NestCast",
      "text": [
        "NestCast was born out of a passion for podcasts and technology. Our founder, Joris Pieters, has been creating podcasts for years. He created the popular podcast \"B&Gay vol Liefde\" about the adventures of the participants in the show \"B&B Vol Liefde\".",
        "Combining a knowledge of podcasts with a background as a Full Stack Developer made it possible to create a high-tech platform for podcast hosting. Given the increasing role of AI and machine learning in technology today, NestCast is also a product that utilizes these technologies. We hope that this allows us to innovate even faster."
      ]
    },
    "WORD": {
      "subTitle": "The technology behind NestCast",
      "title": "Word from the Founder",
      "text": [
        "NestCast started as a side project. Like many developers who are truly passionate about their craft, ideas for new products continually emerge. Over the years, many ideas were considered, but with NestCast, it was clear that this product needed to go into production.",
        "As a freelance developer, having a strong portfolio is important. NestCast was initially a showcase, but as we got more serious about it, our enthusiasm grew. Every milestone brings a satisfying feeling, and this feeling is crucial when your work is also your passion.",
        "NestCast will make its code open source wherever possible. In other words, we prioritize security and privacy, but we also want to share our knowledge with other developers and demonstrate how we approach good solutions.",
        "Joris Pieters"
      ]
    },
    "TECHNIQUES": {
      "title": "Techniques",
      "text": [
        "We use the most advanced techniques and services to achieve the highest possible service level. Users will mainly see the front end of our application, where they manage and distribute their podcasts. We have developed a Single Page Application (SPA), which means the application works without page refreshes during use."
      ],
      "stack": [
        {
          "type": "programming",
          "title": "Tech Stack",
          "text": [
            "NestCast uses Angular to provide a modern user experience. Angular is a framework maintained by Google. TypeScript is used for programming within the framework. In our backend, we use Nest.js, a backend framework built on Node, also using TypeScript for programming. Nest is largely based on the module structure of Angular."
          ],
          "items": [
            {
              "type": "angular",
              "title": "Angular 16",
              "text": "Frontend framework maintained by Google"
            },
            {
              "type": "ngrx",
              "title": "NgRx",
              "text": "State management for Angular based on Redux"
            },
            {
              "type": "nestjs",
              "title": "NestJs",
              "text": "NodeJS backend framework based on the module structure of Angular"
            },
            {
              "type": "nodejs",
              "title": "NodeJs",
              "text": "The framework that made server-side JavaScript possible"
            },
            {
              "type": "typescript",
              "title": "TypeScript",
              "text": "An overlay on JavaScript to provide type safety"
            },
            {
              "type": "javascript",
              "title": "JavaScript",
              "text": "The language of the web"
            }
          ]
        },
        {
          "type": "testing",
          "title": "Automated Testing",
          "text": [
            "To improve the quality of our software and keep costs low, automated tests are essential. We use various types of tests to ensure the quality of our software."
          ],
          "items": [
            {
              "type": "jest",
              "title": "Jest",
              "text": "Jest is a JavaScript testing framework designed to guarantee the accuracy of any JavaScript codebase."
            },
            {
              "type": "spectator",
              "title": "Spectator",
              "text": "A layer on the Angular test framework to simplify testing of Angular components."
            },
            {
              "type": "cypress",
              "title": "Cypress",
              "text": "An end-to-end testing framework for web applications, built on Mocha, Chai, and Sinon."
            }
          ]
        },
        {
          "type": "services",
          "title": "Services",
          "text": [
            "To host our application and distribute your podcast, we use various cloud services. These services are all cloud-based, meaning we don't have our own servers and instead utilize the servers of the service providers. This ensures that we don't have to maintain our own servers and can always use the latest technologies."
          ],
          "items": [
            {
              "type": "aws",
              "title": "AWS",
              "text": "Amazon Web Services is a cloud computing platform offered by Amazon.com."
            },
            {
              "type": "awss3",
              "title": "AWS S3",
              "text": "S3 is AWS's storage service. We use S3 to store the audio files of your podcast."
            },
            {
              "type": "mongodb",
              "title": "MongoDB",
              "text": "A NoSQL database that we use to store the data of your podcast."
            },
            {
              "type": "github",
              "title": "GitHub",
              "text": "This is an online service for managing and sharing our code with other developers."
            },
            {
              "type": "githubactions",
              "title": "GitHub Actions",
              "text": "Automated software deployment using GitHub Actions pipelines."
            }
          ]
        },
        {
          "type": "AI",
          "title": "AI",
          "text": [
            "This text is generated by an AI. We use AI to improve the quality of our software and keep costs low. We use various types of AI to ensure the quality of our software."
          ],
          "items": [
            {
              "type": "codium",
              "title": "Codium",
              "text": "Codium analyzes code and automatically writes tests, and it also provides code suggestions."
            },
            {
              "type": "chatgpt",
              "title": "Chat GPT",
              "text": "ChatGPT is a prototype of an AI-powered chatbot developed by OpenAI."
            },
            {
              "type": "githubcopilot",
              "title": "GitHub Copilot",
              "text": "GitHub Copilot translates natural language hints into code suggestions in multiple languages."
            }
          ]
        }
      ]
    }
  },
  "PRICING": {
    "INTRO": {
      "subTitle": "The best price-quality ratio",
      "title": "Subscriptions",
      "buttonText": "I want to join the waiting list",
      "text": [
        "Our subscriptions will have a low price for both business and individual customers. We primarily target customers who value making their podcast available and accessible.",
        "To keep your podcast available, it's essential that the price remains affordable. When listener numbers decrease, it may no longer be profitable to keep your podcast accessible. We ensure that your podcast remains available at a low cost."
      ],
      "images": [
        "https://images.unsplash.com/photo-1599560324079-af5f94f2c37e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1974&q=80",
        "https://images.unsplash.com/photo-1598805291212-f1e476b437df?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2069&q=80",
        "https://plus.unsplash.com/premium_photo-1679079456625-6981df35fd18?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1976&q=80"
      ]
    },
    "SNIPPET_RIGHT": {
      "title": "Personal Subscription",
      "text": [
        "For hobbyists or novice podcasters, the personal subscription is a good choice. You can host all your episodes and make them available on all major platforms. You have access to an extensive management console to manage your podcast and view statistics.",
        "Companies often have a lot of content that may not be very current but is important to keep available. NestCast helps these companies keep their content accessible without unnecessarily high costs."
      ],
      "images": [
        "assets/images/pictures/personal-1.jpg",
        "assets/images/pictures/personal-2.jpg",
        "assets/images/pictures/personal-3.jpg"
      ]
    },
    "SNIPPET_LEFT": {
      "subTitle": "The best price-quality ratio",
      "title": "Business Subscriptions",
      "text": [
        "For our business customers, we offer a subscription similar to our individual customers. The difference lies in billing, as a business subscription is billed in the company's name.",
        "To keep your podcast accessible, it's essential that the price remains affordable. When listener numbers decrease, it may no longer be profitable to keep your podcast accessible. We ensure that your podcast remains available at a low cost."
      ],
      "images": [
        "assets/images/pictures/business-1.jpg",
        "assets/images/pictures/business-2.jpg",
        "assets/images/pictures/business-3.jpg"
      ]
    },
    "PRICING": {
      "title": "Subscriptions",
      "text": [
        "Starting from early 2024, two subscriptions will be available at a similar price. A business subscription and an individual subscription. The subscriptions come with a fair use policy. If the usage of your podcast exceeds a certain limit, a surcharge will be applied. This surcharge depends on the number of listeners and the duration of the podcast."
      ],
      "cards": [
        {
          "title": "Personal",
          "price": "± €5.00",
          "usps": [
            "Host all your episodes",
            "Extensive management console",
            "Podcast available on major platforms",
            "Statistics"
          ]
        },
        {
          "title": "Business",
          "price": "± €5.00",
          "usps": [
            "Billed in the company's name",
            "Extensive management console",
            "Podcast available on major platforms",
            "Statistics"
          ]
        }
      ]
    }
  },
  "CONTACT": {
    "INTRO": {
      "subTitle": "How are you?",
      "title": "Contact with NestCast",
      "buttonText": "Send us a message",
      "text": [
        "NestCast is a company that aims to be open to customers, technical talent, and colleagues in the podcast hosting field. Just like a part of our software is open source, we are an open book.",
        "We are always looking for new customers, but also for new colleagues. Are you a developer and want to work on an innovative product? Then contact us. If you have feedback on our product, we'd also love to hear it."
      ]
    },
    "PLACE": {
      "subTitle": "Amsterdam is our home",
      "title": "Our location",
      "buttonText": "Send us a message",
      "text": [
        "NestCast is a Dutch company, and we are proud of that. Amsterdam is full of IT talent and has an excellent startup climate. Amsterdam is also the podcast capital of the Netherlands. We are proud to have our company here. Our office is located in Amsterdam West, Bos en Lommer."
      ]
    },
    "FORM": {
      "title": "Send us a message",
      "text": "We love to be in touch with our customers, potential business partners, colleagues, and future employees. Use this form to get in touch with us."
    },
    "SUCCESSMESSAGE": {
      "title": "Thank you for your message",
      "text": "We have received your message."
    },
    "ERRORMESSAGE": {
      "title": "Failed",
      "text": "Your message could not be confirmed, please try again."
    }
  },
  "FOOTER": {
    "ABOUT": {
      "title": "About NestCast",
      "text": [
        "NestCast aims to be the most technologically advanced podcast hosting company. By using AI and the latest techniques, we are able to provide the best service at the lowest price."
      ]
    },
    "CONTACT": {
      "website": "https://www.nestcast.net",
      "email": "info@nestcast.net",
      "title": "Get in touch",
      "name": "NestCast",
      "address": "Hoofdweg 562",
      "zipcode": "1055AB",
      "place": "Amsterdam"
    },
    "NAVIGATION": {
      "title": "Navigation"
    }
  },
  "WAITINGLIST": {
    "FORM": {
      "title": "Sign up for the waiting list",
      "text": "Do you want to be the first to use our podcast hosting platform? Sign up using this form."
    },
    "SUCCESSMESSAGE": {
      "title": "Thank you for your interest",
      "text": "You have been added to the waiting list."
    },
    "ERRORMESSAGE": {
      "title": "Failed",
      "text": "Your registration could not be confirmed, please try again."
    }
  },
  "FORM": {
    "FIRSTNAME": "First Name",
    "LASTNAME": "Last Name",
    "EMAILADDRESS": "Email Address",
    "MESSAGE": "Message",
    "TERMS": "I agree to the terms and conditions",
    "CONTACTTERMS": "I agree to the communication terms"
  },
  "EMAILCONFIRMATION": {
    "title": "Confirm your email address",
    "text": "To prevent abuse and protect your privacy, we ask you to confirm your contact request. This way, we are sure that we do not send unwanted messages. We have sent a code to your email address."
  },
  "CANCEL": "Cancel",
  "CONFIRM": "Confirm",
  "SEND": "Send",
  "MENU": {
    "HOME": "Home",
    "PRICING": "Pricing",
    "ABOUT": "About us",
    "CONTACT": "Contact"
  },
  "SOCIALMEDIA": {
    "INSTAGRAM": "https://www.instagram.com/nestcastnet/",
    "X": "https://x.com/nestcastnet",
    "FACEBOOK": "https://www.facebook.com/profile.php?id=61553274982927",
    "LINKEDIN": "https://www.linkedin.com/company/100249897"
  }
}
