{
  "TITLE": "Dutch2",
  "HOME": {
    "INTRO": {
      "subTitle": "The best hosting for your podcast",
      "title": "Host Your Podcast with NestCast",
      "buttonText": "I want to join the waiting list",
      "text": [
        "NestCast helps you quickly and easily distribute your podcast to platforms like Spotify, Apple Podcasts, Podimo, and other smaller podcast platforms. We ensure your podcast becomes available using an RSS feed, the format used to make podcasts available on platforms like Spotify and Apple Podcasts.",
        "NestCast is capable of delivering the best podcast service at a competitive price. We achieve this through the use of AI and machine learning. Our revolutionary platform is maintained by a small team, keeping our costs low."
      ]
    },
    "SNIPPET_RIGHT": {
      "title": "Podcast Hosting & RSS",
      "text": [
        "To host a podcast, it is necessary to make your audio files available on a server and generate an RSS feed indicating the available episodes. This RSS feed is used by podcast platforms like Spotify and Apple Podcasts to make your podcast accessible to listeners.",
        "There are many companies that focus on podcast hosting, but NestCast is the only one dedicated to hosting and distributing podcasts. This is why we excel in what we do.",
        "We use the latest technologies and services to provide the highest service level possible at an affordable price. We work with Angular 16, NestJs, and MongoDB. This ensures we can offer a fast and reliable service. Our developers are constantly working on innovation and improving our service to ensure you always have a state-of-the-art product."
      ],
      "images": [
        "https://images.unsplash.com/photo-1599560324079-af5f94f2c37e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1974&q=80",
        "https://images.unsplash.com/photo-1598805291212-f1e476b437df?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2069&q=80",
        "https://plus.unsplash.com/premium_photo-1679079456625-6981df35fd18?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1976&q=80"
      ]
    },
    "SNIPPET_LEFT": {
      "title": "Podcast Platforms",
      "text": [
        "Spotify, Amazon Music, Samsung Podcasts, Podcast Index, Listen Notes, Apple Podcasts, Google Podcasts, Pandora, Tune In, iHeartRadio, Deezer. These are just some of the platforms on which we can make your podcast available. We ensure your podcast is accessible to as many listeners as possible.",
        "The RSS feed we create for your podcast is designed to be compatible with all platforms. You have optimal control over how your podcast is displayed on different platforms."
      ],
      "images": [
        "https://images.unsplash.com/photo-1581368087049-7034ed0d1e6f?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1974&q=80",
        "https://images.unsplash.com/photo-1524293568345-75d62c3664f7?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2022&q=80"
      ]
    }
  },
  "ABOUT": {
    "INTRO": {
      "subTitle": "The Technology Behind NestCast",
      "title": "About NestCast",
      "text": [
        "NestCast was born out of a passion for podcasts and technology. Our founder, Joris Pieters, has been creating podcasts for years. He produced the popular podcast 'B&Gay vol Liefde,' which follows the adventures of the participants in the 'B&B Vol Liefde' program.",
        "Combining his knowledge of podcasts with a background as a Full Stack Developer made it possible to create a highly technological platform for podcast hosting. In today's world, where AI and machine learning play an increasingly significant role in technology, NestCast is a product that harnesses these technologies for faster innovation."
      ]
    },
    "TECHNIQUES": {
      "title": "Techniques",
      "text": [
        "We use the latest techniques and services to provide the highest service level possible. Users mainly interact with the front end of our application to manage and distribute their podcasts. We've developed a Single Page Application (SPA) for this purpose, resulting in a user experience that works without page refreshes during use."
      ],
      "stack": [
        {
          "type": "programming",
          "title": "Tech Stack",
          "text": [
            "NestCast uses Angular to deliver a modern user experience. Angular is a framework maintained by Google. Within the framework, TypeScript is used for programming. In our backend, we use Nest.js, a backend framework based on Node, and TypeScript is also the programming language. Nest's structure is largely based on Angular."
          ],
          "items": [
            {
              "type": "angular",
              "title": "Angular 16",
              "text": "Frontend framework maintained by Google"
            },
            {
              "type": "ngrx",
              "title": "NgRx",
              "text": "State management for Angular based on Redux"
            },
            {
              "type": "nestjs",
              "title": "NestJs",
              "text": "NodeJS backend framework based on Angular's module structure"
            },
            {
              "type": "nodejs",
              "title": "NodeJs",
              "text": "The framework that enabled server-side JavaScript"
            },
            {
              "type": "typescript",
              "title": "TypeScript",
              "text": "A layer on top of JavaScript to provide type safety"
            },
            {
              "type": "javascript",
              "title": "JavaScript",
              "text": "The language of the web"
            }
          ]
        },
        {
          "type": "testing",
          "title": "Automated Tests",
          "text": [
            "To improve the quality of our software and keep costs low, automated tests are indispensable. We use various types of tests to ensure the quality of our software."
          ],
          "items": [
            {
              "type": "jest",
              "title": "Jest",
              "text": "Jest is a JavaScript testing framework designed to guarantee the accuracy of any JavaScript codebase."
            },
            {
              "type": "spectator",
              "title": "Spectator",
              "text": "A layer on top of the Angular testing framework to simplify testing Angular components."
            },
            {
              "type": "cypress",
              "title": "Cypress",
              "text": "An end-to-end testing framework for web applications. It is built on top of Mocha, Chai, and Sinon."
            }
          ]
        },
        {
          "type": "services",
          "title": "Services",
          "text": [
            "To host our application and distribute your podcast, we use various cloud services. These services are all cloud-based, meaning we do not have our own servers and instead utilize the servers of the service providers. This allows us to avoid server maintenance and stay up to date with the latest technologies."
          ],
          "items": [
            {
              "type": "aws",
              "title": "AWS",
              "text": "Amazon Web Services is a cloud computing platform offered by Amazon.com."
            },
            {
              "type": "awss3",
              "title": "AWS S3",
              "text": "S3 is the storage service of AWS. We use S3 to store the audio files of your podcast."
            },
            {
              "type": "mongodb",
              "title": "MongoDB",
              "text": "A NoSQL database that we use to store the data of your podcast."
            },
            {
              "type": "github",
              "title": "GitHub",
              "text": "This is an online service for managing and sharing our code with other developers."
            },
            {
              "type": "githubactions",
              "title": "GitHub Actions",
              "text": "Automated software deployment using GitHub Actions pipelines."
            }
          ]
        },
        {
          "type": "AI",
          "title": "AI",
          "text": [
            "This text is generated by an AI. We use AI to enhance the quality of our software and keep costs low. We use various types of AI to ensure the quality of our software."
          ],
          "items": [
            {
              "type": "codium",
              "title": "Codium",
              "text": "Codium analyzes code and automatically writes tests, and it also provides code suggestions."
            },
            {
              "type": "chatgpt",
              "title": "Chat GPT",
              "text": "ChatGPT is a prototype of an AI-powered chatbot developed by OpenAI."
            },
            {
              "type": "githubcopilot",
              "title": "GitHub Copilot",
              "text": "GitHub Copilot translates natural language hints into code suggestions in dozens of languages."
            }
          ]
        }
      ]
    }
  },
  "PRICING": {
    "INTRO": {
      "subTitle": "The highest price quality",
      "title": "Subscriptions",
      "buttonText": "Join the waiting list",
      "text": [
        "Our subscriptions will have a low price for both business and private customers. We mainly focus on customers who consider it important to have their podcast available and accessible.",
        "To keep your podcast available, it's crucial that the price isn't too high. When the number of listeners decreases, it may no longer be profitable to keep your podcast available. We ensure that your podcast remains available at a low price."
      ],
      "images": [
        "https://images.unsplash.com/photo-1599560324079-af5f94f2c37e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1974&q=80",
        "https://images.unsplash.com/photo-1598805291212-f1e476b437df?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2069&q=80",
        "https://plus.unsplash.com/premium_photo-1679079456625-6981df35fd18?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1976&q=80"
      ]
    },
    "SNIPPET_RIGHT": {
      "title": "Personal subscription",
      "text": [
        "For hobbyists or novice podcasters, the personal subscription is a good choice. You can host all your episodes and make them available on all major platforms. You have access to an extensive management console to manage your podcast and view statistics.",
        "Businesses often have a lot of content that may not be very current but is important to keep available. NestCast helps these businesses keep their content available without incurring unnecessary costs."
      ],
      "images": [
        "https://images.unsplash.com/photo-1599560324079-af5f94f2c37e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1974&q=80",
        "https://images.unsplash.com/photo-1598805291212-f1e476b437df?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2069&q=80",
        "https://plus.unsplash.com/premium_photo-1679079456625-6981df35fd18?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1976&q=80"
      ]
    },
    "SNIPPET_LEFT": {
      "subTitle": "The highest price quality",
      "title": "Business subscriptions",
      "text": [
        "For our business customers, we offer a similar subscription to our private customers. The difference lies in the billing. With a business subscription, the invoice is issued in the name of the company.",
        "To keep your podcast available, it's crucial that the price isn't too high. When the number of listeners decreases, it may no longer be profitable to keep your podcast available. We ensure that your podcast remains available at a low price."
      ],
      "images": [
        "https://images.unsplash.com/photo-1599560324079-af5f94f2c37e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1974&q=80",
        "https://images.unsplash.com/photo-1598805291212-f1e476b437df?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2069&q=80",
        "https://plus.unsplash.com/premium_photo-1679079456625-6981df35fd18?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1976&q=80"
      ]
    },
    "PRICING": {
      "title": "Subscriptions",
      "text": [
        "Starting from early 2024, two subscriptions will be available with a comparable price. A business subscription and a private subscription. These subscriptions are available with a so-called fair use policy. If your podcast's usage exceeds a certain threshold, a surcharge will be applied. This surcharge depends on the number of listeners and the duration of the podcast."
      ],
      "cards": [
        {
          "title": "Personal",
          "price": "± €5.00",
          "usps": [
            "Host all your episodes",
            "Extensive management console",
            "Podcast available on major platforms",
            "Statistics"
          ]
        },
        {
          "title": "Business",
          "price": "± €5.00",
          "usps": [
            "In the company's name",
            "Extensive management console",
            "Podcast available on major platforms",
            "Statistics"
          ]
        }
      ]
    }
  },
  "CONTACT": {
    "INTRO": {
      "subTitle": "Amsterdam is our home",
      "title": "Contact NestCast",
      "buttonText": "Send us a message",
      "text": [
        "NestCast is an Amsterdam-based company, and we are proud of it. Amsterdam is filled with IT talent and has an excellent start-up environment. Amsterdam is also the podcast capital of the Netherlands. We are proud to have our company here. Our office is located in Amsterdam West, Bos en Lommer.",
        "We'd like to get in touch with anyone interested in podcast hosting. We're always looking for new customers and new colleagues. Are you a developer and want to work on an innovative product? Get in touch with us."
      ]
    },
    "FORM": {
      "title": "Send us a message",
      "text": "We are eager to connect with our customers, potential business partners, colleagues, and future employees. Use this form to get in touch with us."
    },
    "SUCCESSMESSAGE": {
      "title": "Thank you for your message",
      "text": "We have received your message."
    },
    "ERRORMESSAGE": {
      "title": "Failed",
      "text": "Your message could not be confirmed, please try again."
    }
  },
  "FOOTER": {
    "ABOUT": {
      "title": "About NestCast",
      "text": [
        "NestCast aims to be the most technically advanced podcast hosting company. Through the use of AI and the latest technologies, we are able to provide the best service at the lowest price."
      ]
    },
    "CONTACT": {
      "website": "https://www.nestcast.com",
      "email": "info@nestcast.com",
      "title": "Get in touch",
      "name": "NestCast",
      "address": "Hoofdweg 562",
      "zipcode": "1055AB",
      "place": "Amsterdam"
    },
    "NAVIGATION": {
      "title": "Navigation"
    }
  },
  "WAITINGLIST": {
    "FORM": {
      "title": "Join the waiting list",
      "text": "Do you want to be among the first to use our podcast hosting platform? Sign up using this form."
    },
    "SUCCESSMESSAGE": {
      "title": "Thank you for your interest",
      "text": "You have been added to the waiting list."
    },
    "ERRORMESSAGE": {
      "title": "Failed",
      "text": "Your registration could not be confirmed, please try again."
    }
  },
  "FORM": {
    "FIRSTNAME": "First Name",
    "LASTNAME": "Last Name",
    "EMAILADDRESS": "Email Address",
    "MESSAGE": "Message",
    "TERMS": "I agree to the terms and conditions",
    "CONTACTTERMS": "I agree to the communication terms"
  },
  "EMAILCONFIRMATION": {
    "title": "Confirm your email address",
    "text": "To prevent abuse and protect your privacy, we ask you to confirm your contact request. This way, we ensure that we do not send unwanted messages. We have sent a code to your email address."
  },
  "CANCEL": "Cancel",
  "CONFIRM": "Confirm",
  "SEND": "Send"
}
